[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:9:31
 
 export default function RecommendationRequestCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (requests) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: requests.requesterEmail,
-      professorEmail: requests.professorEmail,
-      explanation: requests.explanation,
-      dateRequested: requests.dateRequested,
-      dateNeeded: requests.dateNeeded,
-      done: requests.done
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (requests) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:9:46
 
 export default function RecommendationRequestCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (requests) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: requests.requesterEmail,
-      professorEmail: requests.professorEmail,
-      explanation: requests.explanation,
-      dateRequested: requests.dateRequested,
-      dateNeeded: requests.dateNeeded,
-      done: requests.done
-    }
-  });
+  const objectToAxiosParams = (requests) => ({});
 
   const onSuccess = (requests) => {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:10:10
 export default function RecommendationRequestCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (requests) => ({
-    url: "/api/recommendationrequest/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 1"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:22:35
     }
   });
 
-  const onSuccess = (requests) => {
-    toast(`New recommendation request Created - id: ${requests.id}`);
-  }
+  const onSuccess = (requests) => {}
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 1"

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:23:11
   });
 
   const onSuccess = (requests) => {
-    toast(`New recommendation request Created - id: ${requests.id}`);
+    toast(``);
   }
 
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 1"
Received: ""

Number of calls: 1
