[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest Updated - id: 17 email: requesterEmail"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:26:10
 
 
   const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest",
+    url: "",
     method: "PUT",
     params: {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest Updated - id: 17 email: requesterEmail"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:41:48
     }
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(`RecommendationRequest Updated - id: ${recommendationRequest.id} email: ${recommendationRequest.requesterEmail}`);
-  }
+  const onSuccess = (recommendationRequest) => {}
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:67:11
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
         {
-          recommendationRequest && <RecommendationRequestForm initialContents={recommendationRequest} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-requesterEmail"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:67:11
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
         {
-          recommendationRequest && <RecommendationRequestForm initialContents={recommendationRequest} submitAction={onSubmit} buttonLabel="Update" />
+          true
         }
       </div>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-requesterEmail"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
