[Killed] ArrayDeclaration
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:32:7
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/recommendationrequest/all"],
       { method: "GET", url: "/api/recommendationrequest/all" },
-      []
+      ["Stryker was here"]
     );
 
killedBy: RecommendationRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-id" role="cell" /> instead
