[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:122:22
                     {...register("dateAdded", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateAdded && 'LocalDateTime is required. '}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:122:22
                     {...register("dateAdded", { required: true, pattern: isodate_regex })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateAdded && 'LocalDateTime is required. '}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
