[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:9:33
 
 export default function ArticlesCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (article) => ({
-        url: "/api/articles/post",
-        method: "POST",
-        params: {
-          title: article.title,
-          url: article.url,
-          explanation: article.explanation,
-          email: article.email,
-          dateAdded: article.dateAdded
-        }
-      });
+    const objectToAxiosParams = () => undefined;
     
       const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:21:38
         }
       });
     
-      const onSuccess = (article) => {
-        toast(`New article Created - id: ${article.id} title: ${article.title}`);
-      }
+      const onSuccess = (article) => {}
     
       const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New article Created - id: 17 title: How to use Spring Data JDBC with Spring Boot"

Number of calls: 0
